from copy import deepcopy

l1 = [1, 2, 3]
l2 = l1
l2.append(4)
print(l1)
print("*************************")
print(l2)
print("*************************")

a1 = [1, 2, 3]
a2 = a1.copy()
a2.append(4)
print(a1)
print("*************************")
print(a2)
print("*************************")

b1 = [1, 2, 3, [5, 6, 7]]
b2 = b1.copy()
b2[-1].append(8)
b2.append(4)
print(b1)
print("*************************")
print(b2)
print("*************************")


c1 = [1, 2, 3, [5, 6, 7]]
c2 = deepcopy(c1)
c2[-1].append(8)
c2.append(4)
print(c1)
print("*************************")
print(c2)
print("*************************")

# Кортежи - работает как со списками, нельзя переопределить (неизменяемый список)
t = (1, 2, 3, 4, 5)

# Frozenset - неизменяемое множество (сейчас не используется)
frozenset({1, 2, 3, 4, })
